# hw_4.1
# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!
# Приклад:
# [0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
# [0] -> [0]
# [1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
# [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]
# Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від користувача не потрібно.

# arr = [0, 1, 0, 12, 3]
# arr = [0]
# arr = [1, 0, 13, 0, 0, 0, 5]
# arr = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
# for numb in arr:
#     if numb == 0:
#         arr.remove(numb)
#         arr.append(numb)
#
#
# print(arr)


# hw_4.2
# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й і тд],
# потім перемножити цю суму на останній елемент вхідного масиву. Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0. Пояснення:
# [0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88
# [1, 3, 5] => 30
# [6] => 36
# [] => 0
# Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від користувача не потрібно.

# arr = [0, 1, 7, 2, 4, 8]
# arr = [1, 3, 5]
# arr = [6]
# arr = []
# summ=0
# if len(arr) == 0:
#     summ = 0
# else:
#     for i in range(0, len(arr), 2):
#
#      summ = summ + arr[i]
#     summ = summ * arr[-1]
# print(summ)


# hw_4.3

# Створіть список випадкових чисел із випадковою кількістю елементів від 3 до 10.
# Ваше завдання - створити новий список з 3 елементів початкового списку - першим, третім і другим з кінця. Приклад:
# [1, 2, 3, 4, 5, 6, 7, 9] == [1, 3, 7]
# [1, 1, 2, 1] == [1, 2, 2]
# [6, 3, 7] == [6, 7, 3]

import random
NUMS_SIZE = random.randint(3, 10)
numbers = []
for i in range(NUMS_SIZE):
    numbers.append(random.randint(1, 10))
print(numbers)
arr = []
arr.insert(0, numbers[0])
arr.insert(1, numbers[2])
arr.append(numbers[-2])
print(arr)